Revit 2027 API
BasicFileInfo.Extract Method
 Returns an instance of BasicFileInfo filled with basic information about a Revit file located at the given file-path
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static BasicFileInfo Extract(
	string file
)
Public Shared Function Extract (
	file As String
) As BasicFileInfo
public:
static BasicFileInfo^ Extract(
	String^ file
)
static member Extract :
        file : string -> BasicFileInfo
Parameters
file String
 The full path to the file to be queried, including project (.rvt) and family (.rfa) files.
Return Value
BasicFileInfo
 If successful, basic file data.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
FileArgumentNotFoundException |  The file doesn't exist.
InvalidOperationException |  The file is a newer format file where the structure of the BasicFileInfo storage has changed, or the file is saved in very old version of Revit without basic file data.
See Also
Reference
BasicFileInfo Class
Autodesk.Revit.DB Namespace